import type { Person } from '../types';

export const peopleData: Person[] = [

  {
    id: 1,
    name: 'Некрашевич Илья Георгиевич',
    born: "02.08",
    died: "18.11",
    dates: "02.08.1905 - 18.11.1993",
    shortDesc: 'Беларуский физик, заслуженный деятель науки БССР, профессор БГУ',
    funFacts: [
      'Панически боялся микробов и мыл руки по несколько раз в час.',
      
    ],
    wikiUrl: 'https://ru.wikipedia.org/wiki/%D0%9D%D0%B5%D0%BA%D1%80%D0%B0%D1%88%D0%B5%D0%B2%D0%B8%D1%87%2C_%D0%98%D0%BB%D1%8C%D1%8F_%D0%93%D1%80%D0%B8%D0%B3%D0%BE%D1%80%D1%8C%D0%B5%D0%B2%D0%B8%D1%87'
  },
   {
    id: 2,
    name: 'Алесь Адамович',
    born: "03.08",
    died: "26.01",
    dates: "02.08.1905 - 18.11.1993",
    shortDesc: 'Беларуский советский писатель, сценарист и литературовед, критик',
    funFacts: [
      'В 1930 году дедушку Алеся Адамовича по линии матери, Митрофана Фомича Тычина, «раскулачили» и сослали вместе с женой и тремя детьми в Якутию',
      
    ],
    wikiUrl: 'https://ru.wikipedia.org/wiki/%D0%9D%D0%B5%D0%BA%D1%80%D0%B0%D1%88%D0%B5%D0%B2%D0%B8%D1%87%2C_%D0%98%D0%BB%D1%8C%D1%8F_%D0%93%D1%80%D0%B8%D0%B3%D0%BE%D1%80%D1%8C%D0%B5%D0%B2%D0%B8%D1%87'
  },
];